{
    "version": "https://jsonfeed.org/version/1",
    "title": "aakrity needs to document",
    "description": "",
    "home_page_url": "https://aakritymadhan.com",
    "feed_url": "https://aakritymadhan.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Aakrity Madhan"
    },
    "items": [
        {
            "id": "https://aakritymadhan.com/climate-work-is-hard.html",
            "url": "https://aakritymadhan.com/climate-work-is-hard.html",
            "title": "Climate work is hard. But we will make it to the other side.",
            "summary": "Powerless! This is how I define the last three years of my life. In 2019, my then partner decided to leave after four&hellip;",
            "content_html": "<p>Powerless! This is how I define the last three years of my life. In 2019, my then partner decided to leave after four long years of planning a life together. I was alone, heart-broken, and often curled up in a ball on my bed, wondering– why would he leave. Before I knew it, five words had become my identity – I am not good enough.</p>\n<p>I would spend hours second-guessing my decisions, staring blankly into space. I was intimidated of my friends’ achievements. Why was I not good at coding like Kritika; how did Anuradha know her path when I didn’t; would I find a good job like Ashu? A fear had set in. </p>\n<p>Mind you, this is also the time that I got into Harvard <em>with a merit scholarship</em>, found the love of my life, and decided to build a startup with my friends. I was doing all these new things, but I was afraid of all of them. Not the good kind of afraid but the afraid that is debilitating. I was afraid to put words on paper, afraid of starting projects. It led to an incessant cycle of procrastination and associated guilt. I became afraid of myself. I didn’t know who this new person was. The cheerful, confident, and amazing me became an imposter, a fraud.</p>\n<p>Here is where I introduce you to my loveliest mostest, my best friend in this whole wide world – Abhishek. <a href=\"https://abhishekchoudhary.com/\" target=\"_blank\" rel=\"noopener noreferrer\">This guy.</a> He saw it all – my tears, my anxiety, and my fear. One day last fall, he sat me down in our living room, a very serious expression on his face and asked me – Aakrity, are you speaking to yourself with compassion? Are you speaking to yourself like a friend?</p>\n<p>Was I? No. For three years I was beating myself up – every single day. The voice in my head was critical – when I took a break - “I wasted time”; when I was lonely – “I am needy”; when I was crying – “I am weak”; when I wasn’t feeling my 100% at work – “I am not smart”, and overall – “I am not good enough”. Sound familiar?</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/Slide1-2.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-xs.jpeg 300w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-sm.jpeg 480w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-md.jpeg 768w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-lg.jpeg 1024w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-xl.jpeg 1360w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide1-2-2xl.jpeg 1600w\"  alt=\"Am I good enough?\" width=\"720\" height=\"405\"></figure>\n<p>Being a changemaker is hard. Climate work is hard. A sustainable future seems to be slipping away like sand from our hands. 60% of young people say they feel powerless when they think about climate change. I assume that most of you who might be reading this will spend your lifetimes dedicated to this cause. That is a long time to feel powerless. That is a long time to doubt yourselves. That is a long time to not have hope.</p>\n<p>Climate work is hard. Period. It demands that we claim our power. It demands that we enjoy our work. It demands optimism and hope. And for that it is important to take care of our well-being.</p>\n<p>It’s been a year since that conversation in my living room, and having compassion for myself, speaking to myself like a friend, has built a stronger version of me. I have changed therapists, gotten medication for my depression. I gave myself flexibility and time to figure things out. Even taking a semester off. But most importantly, I learnt that I was in the wrong kind of climate work. Building simulations were not for me. Coding was not for me. Rather, I have found myself enjoying negotiating about climate, thinking about social implications of climate policies, and most of all, creating value the best way I know how.</p>\n<p>So the next time you find that inner voice speaking unkindly to you, ask yourselves – Am I speaking to myself with compassion? And then remind yourselves to flip that narrative from “I wasted time” to “I needed a break”; from “I am needy” to “I need a friend”; from “I am weak” to “My emotions are valid”; from “I am not smart” to “I can work on myself”; and most importantly from “I am not good enough” to “I am amazing and proud of myself”.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/Slide2.jpeg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-xs.jpeg 300w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-sm.jpeg 480w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-md.jpeg 768w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-lg.jpeg 1024w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-xl.jpeg 1360w ,file:///Users/aakrity/Documents/Publii/sites/aakritys-website/input/media/posts/1/responsive/Slide2-2xl.jpeg 1600w\"  alt=\"I am good enough\" width=\"720\" height=\"405\"></figure>\n<p>I promise you – you will find your power back!</p>",
            "author": {
                "name": "Aakrity Madhan"
            },
            "tags": [
                   "power",
                   "mentalhealth",
                   "climatechange",
                   "changethenarrative"
            ],
            "date_published": "2022-06-11T20:42:32-04:00",
            "date_modified": "2022-06-11T20:53:06-04:00"
        }
    ]
}
